OpenFOAM-5.x-master/tutorials/heatTransfer/buoyantSimpleFoam/hotRadiationRoomFvDOM/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    floor
    {
        type            calculated;
        value           uniform 100000;
    }

    ceiling
    {
        type            calculated;
        value           uniform 100000;
    }

    fixedWalls
    {
        type            calculated;
        value           uniform 100000;
    }

    box
    {
        type            calculated;
        value           uniform 100000;
    }
}

// ************************************************************************* //
